Repository: sakkada/django-eavkit
Catalog: eavkit/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Attributes
ru: Атрибуты

source: Choice value "%s" incorrect.
ru: Значение "%s" из списка некорректно.

source: Choice value "%s" incorrect: %s.
ru: Значение "%s" из списка некорректно: %s.

source: Choice values are not unique.
ru: Список содержит одинаковые значения.

source: Choices must be defined if multiple.
ru: Список значений должен быть заполнен, если поле должно поддерживать множественный выбор.

source: String
ru: Строка

source: Must be str or unicode
ru: Значение должно быть строкой (str или unicode)

source: Integer
ru: Целое число

source: Must be an integer
ru: Значение должно быть целым числом

source: Float
ru: Десятичное (вещественное) число

source: Must be a float
ru: Значение должно быть десятичным (вещественным) числом

source: Text
ru: Текст

source: Boolean
ru: Логическое значение (True или False)

source: Must be a boolean
ru: Значение должно быть логическим (True или False)

source: Date
ru: Дата (date)

source: Must be a date
ru: Значение должно быть объектом date (датой)

source: Date and Time
ru: Дата с временем (datetime)

source: Must be a datetime
ru: Значение должно быть объектом datetime (датой с временем)

source: EAV Kit
ru: Атрибуты (EAV – Сущность-Атрибут-Значение)

source: The %s could not be saved because the data didn't validate.
ru: Значение %s не может быть сохранено — данные не прошли проверку.

source: Must be all lower case, start with a letter, and contain only letters, numbers, or underscores.
ru: Значение должно быть в нижнем регистре, начинаться с бувкы и содержать только бувкы, цифры и символы подчеркивания.

source: site
ru: сайт

source: name
ru: название

source: User-friendly attribute name
ru: Название атрибута (title)

source: slug
ru: код атрибута

source: Short unique attribute code
ru: Уникальный код атрибута

source: description
ru: Описание

source: Short description
ru: Короткое описание

source: multiple
ru: Поддержка множественного выбора

source: required
ru: Обязательно для заполнения

source: data type
ru: тип данных

source: code
ru: код для фильтрации

source: choices
ru: список возможных значений

source: weight
ru: вес

source: created
ru: дата создания

source: modified
ru: дата модификации

source: Attribute options
ru: Настройки атрибутов

source: Attributes options
ru: Настройки атрибута

source: %(obj)s has no EAV attribute named '%(attr)s'
ru: Объект %(obj)s не имеет EAV атрибута с именем «%(attr)s»

source: %(attr)s EAV field cannot be blank
ru: EAV поле %(attr)s не может быть пустым

source: %(attr)s EAV field %(err)s
ru: Ошибка EAV поля %(attr)s — %(err)s
